app/views/user/programs/_form.html.erb


    <% unless @program.program_items.any? %>
---
SELECT "program_items".* FROM "program_items" WHERE "program_items"."program_id" = $1  [["program_id", 1]]