app/controllers/user/program_items_controller.rb

  def set_program
    @program = Program.find(params[:program_id])
---
SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT 1  [["id", 7]]