app/controllers/user/programs_controller.rb

  def create
    @program = Program.new
    @program.program_items.build(status: ProgramItem::STATUS_DRAFT)
    @program.save
---
INSERT INTO "program_items" ("status", "program_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status", "draft"], ["program_id", 6], ["created_at", "2017-03-19 23:10:12.191191"], ["updated_at", "2017-03-19 23:10:12.191191"]]
INSERT INTO "programs" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-03-19 23:10:12.189904"], ["updated_at", "2017-03-19 23:10:12.189904"]]

  def set_program
    @program = Program.find(params[:id])
---
SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT 1  [["id", 7]]